lectures/lect-03.tex
% Created 2015-01-28 Wed 19:19
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\author{Derek Harter}
\date{CSci 515 Spring 2014 \textit{<2015-01-28 Wed>}}
\title{Lecture 03 Notes}
\hypersetup{
  pdfkeywords={},
  pdfsubject={Lecture 03 Notes.},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.4)}}
\begin{document}

\maketitle

\section{First Session (11 - 11:40)}
\label{sec-1}
\subsection{Streams}
\label{sec-1-1}
The IOStream library is a new (object oriented) library, added with the C++
language, to support Input and Output to source and destination devices.

The source of input can be a keyboard, a file, or some other device.  Likewise
the destination of output can be to a file, to a terminal screen, or to some
other device (for example you can send output into another C variable, like
a string in memory).

A stream is a way of visualizing how data is transferred from the source to 
destination.  A stream is inherently serial, the order in which you put things
into the stream, is the order they will be received when they come out of the
stream.
\subsection{iostream header}
\label{sec-1-2}
You've already seen many examples of specifying the iostream header using

\begin{minted}[linenos=true,frame=lines,numbersep=5pt,fontsize=\footnotesize]{c}
#include <iostream>
\end{minted}

Iostream operators and objects are defined in the std namespace, thus you
explicitly have to specify "std::" before using them, or include the

\begin{minted}[linenos=true,frame=lines,numbersep=5pt,fontsize=\footnotesize]{c}
using namespace std;
\end{minted}

directive.

In addition to iostream, if you want to do I/O to files, you need to include
the fstream header.  If you want to manipulate and format the data in/out of
the stream, you need to include the iomanip header.


\section{Second Session (11:45 - 12:30)}
\label{sec-2}
\subsection{Algorithm}
\label{sec-2-1}
An algorithm is a series of unambiguous explicit steps that can be taken to solve a problem.
An algorithm is a procedure for solving a problem in terms of:

\begin{enumerate}
\item the actions to execute and
\item the order in which the actions execute
\end{enumerate}

\subsection{Control Structures}
\label{sec-2-2}
Normally statements in a program execute one after the other in the
order in which they are written.  This is sequential execution.

\begin{itemize}
\item The sequence structure is built into the C language normal operation.
Question: what/where is the first instruction executed in a C program?
\item Selection statements: single if, double if / else, multiple switch
\item Repetition statements: for, while (0 or more) and do..while (1 or more)
\end{itemize}
\subsection{Multiple Selection with if..else}
\label{sec-2-3}
\begin{itemize}
\item can make 1 of multiple possible decisions using nested if statements.
\end{itemize}
\subsection{Basic loop}
\label{sec-2-4}
\begin{itemize}
\item while loop repeats a set of statements 0 or more times, checking for
a condition before beginning and before each repetition of the
statements in the body of the loop.
\item An infinite loop occurs when you don't properly change values so
that the condition of the loop is eventually false.
\end{itemize}
\subsection{Different types of repetition}
\label{sec-2-5}
\begin{itemize}
\item Our first while loop is a kind of purely logical controlled repetition.  We keep repeating as long as the condition
\end{itemize}
is true, and once it becomes false we stop.
\begin{itemize}
\item A common variation is, Counter-Controlled repetition, when you know you need to process X specific items (we will see a better way of doing
\end{itemize}
this with a for loop next.)
\begin{itemize}
\item Discuss an off-by-one error in a counter-controlled loop.
\item Sentenial-controlled repetition means we keep repeating until we see
some condition.  Our first example is really a sentenial-controlled
loop, though a more typical example is to have some explicit
sentenial/flag.
\end{itemize}

\subsection{Increment, decrement and assignment}
\label{sec-2-6}
\begin{itemize}
\item C provides several assignment operators for abbreviating
assignment since it is very common to need to manipulate a value and
assign it back to the variable. (+=, -=, *=, etc.)
\item increment and decrement are uniary operators.  We can increment and
decrement using pre or post increment, which means either we first
incrmeent the value then use that in the expression, or we first use
current value in expression then increment after.
\end{itemize}
\section{Third Session (12:40 - 1:40)}
\label{sec-3}

\subsection{for Loop for Counter-Controlled Repetition}
\label{sec-3-1}
\begin{itemize}
\item Counter-controlled loops are so commonly needed (especially when
processing arrays of elements later), that C provides a special
construct for implementing them.
\item Parts of a for loop, initialization, test, manipulation.
\item Give examples of counting up and counting down.
\item Give example of counting with a step size.
\end{itemize}
\subsection{do..while Repetition}
\label{sec-3-2}
\begin{itemize}
\item If we need to ensure some statements are always executed at least
once, use do..while construct.  Useful so we can avoid duplicating
some code.
\end{itemize}
\subsection{switch statement}
\label{sec-3-3}
\begin{itemize}
\item You may run across the switch statement.  Switch provides multiple-selection (like nested if).
\item It is limited, can only compare the value of a variable to a
constant integral expression (e.g. our example of grades in ranges
can't be accomplished using switch, we still need to use nested if
for them.)
\item switch statement requires use of break statements.
\item break and continue statements can be useful sometimes in loops, to
avoid some unnecessary repetitions of the loop.
\item For example, in the prime number algorithm, we don't need to perform
any more loops after we find first negative example.
\item Can use a break statement.  An equivalent effect can be achieved by using a flag.
\item continue can be used to skip any remaining statemens in current
iteration, and then start immediately with the next iteration of the
loop.
\end{itemize}

\subsection{Visual Studio Tips}
\label{sec-3-4}
\begin{itemize}
\item Turn on expert settings
\item Format selection Ctrl-k Ctrl-f
\end{itemize}
% Emacs 24.3.1 (Org mode 8.2.4)
\end{document}
